src/main/java/com/amdocs/halo/automation/xmls/manageOrderRequestMIS_MACD_SG.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
 <soapenv:Header/>
   <soapenv:Body>
      <ns1:manageOrderRequest xmlns:ns1="http://cio.att.com/order/management/model" xmlns="http://cio.att.com/entity/model" xmlns:ns0="http://cio.att.com/ord/model" xmlns:ns2="http://cio.att.com/req/model">
         <ns1:order>
            <ns2:eid>
               <context>OCX</context>
               <id>{$sorId$}</id>
               <entityType>SOR</entityType>
            </ns2:eid>
            <ns0:isBundle>true</ns0:isBundle>
            <ns0:subOrders>
               <ns0:item>
                  <ns2:eid>
                     <context>OCX</context>
                     <id>{$sgId$}</id>
                     <entityType>Order</entityType>
                  </ns2:eid>
                  <ns2:type>DECOMPOSE</ns2:type>
                  <ns2:characteristics>
                     <item>
                        <name>ServiceGroupOrderId</name>
                        <value>{$sgId$}</value>
                     </item>
                     <item>
                        <name>serviceGroupCounter</name>
                        <value>1</value>
                     </item>
                     <item>
                        <name>ActivityGroupId</name>
                        <value>62081259</value>
                     </item>
                  </ns2:characteristics>
                  <ns2:associations>
                     <item>
                        <associationName>associatedServiceOrder</associationName>
                        <items>
                           <item>
                              <context>OCX</context>
                              <id>{$oaId$}</id>
                              <entityType>OrderAction</entityType>
                              <type>MISS</type>
                              <product>MIS</product>
                           </item>
                        </items>
                     </item>
                  </ns2:associations>
                  <ns0:isBundle>false</ns0:isBundle>
                  <ns0:actionType>CH</ns0:actionType>
                  <ns0:actionSubType>NA</ns0:actionSubType>
                  <ns0:version>1</ns0:version>
               </ns0:item>
            </ns0:subOrders>
         </ns1:order>
      </ns1:manageOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>